QuantumLeaps/qpcpp-examples/arm-cm/game_efm32-slstk3401a/qv/bsp.cpp
//============================================================================
// Product: "Fly 'n' Shoot" game example, EFM32-SLSTK3401A board, QV kernel
//
// Copyright (C) 2005 Quantum Leaps, LLC. All rights reserved.
//
//                    Q u a n t u m  L e a P s
//                    ------------------------
//                    Modern Embedded Software
//
// SPDX-License-Identifier: GPL-3.0-or-later OR LicenseRef-QL-commercial
//
// This software is dual-licensed under the terms of the open-source GNU
// General Public License (GPL) or under the terms of one of the closed-
// source Quantum Leaps commercial licenses.
//
// Redistributions in source code must retain this top-level comment block.
// Plagiarizing this software to sidestep the license obligations is illegal.
//
// NOTE:
// The GPL does NOT permit the incorporation of this code into proprietary
// programs. Please contact Quantum Leaps for commercial licensing options,
// which expressly supersede the GPL and are designed explicitly for
// closed-source distribution.
//
// Quantum Leaps contact information:
// <www.state-machine.com/licensing>
// <info@state-machine.com>
//============================================================================
#include "qpcpp.hpp"   // QP/C++ real-time event framework
#include "bsp.hpp"     // Board Support Package
#include "app.hpp"     // Application

#include "em_device.h" // the device specific header (SiLabs)
#include "em_chip.h"   // Chip errata (SiLabs)
#include "em_cmu.h"    // Clock Management Unit (SiLabs)
#include "em_gpio.h"   // GPIO (SiLabs)
#include "em_usart.h"  // USART (SiLabs)
#include "display_ls013b7dh03.h" // LS013b7DH03 display (SiLabs/QL)
// add other drivers if necessary...

//============================================================================
namespace { // unnamed local namespace

Q_DEFINE_THIS_FILE

// Local-scope objects -------------------------------------------------------
constexpr GPIO_Port_TypeDef LED_PORT {gpioPortF};
constexpr std::uint32_t LED0_PIN     {4U};
constexpr std::uint32_t LED1_PIN     {5U};

constexpr GPIO_Port_TypeDef PB_PORT  {gpioPortF};
constexpr std::uint32_t PB0_PIN      {6U};
constexpr std::uint32_t PB1_PIN      {7U};

// LCD geometry and frame buffer
static std::uint32_t l_fb[BSP::SCREEN_HEIGHT + 1][BSP::SCREEN_WIDTH / 32U];

// the walls buffer
static std::uint32_t l_walls[APP::GAME_TUNNEL_HEIGHT + 1][BSP::SCREEN_WIDTH / 32U];

static unsigned l_rnd;  // random seed

static void paintBits(std::uint8_t x, std::uint8_t y,
    std::uint8_t const *bits, std::uint8_t h);
static void paintBitsClear(std::uint8_t x, uint8_t y,
    std::uint8_t const *bits, std::uint8_t h);

#ifdef Q_SPY
    enum AppRecords { // application-specific trace records
        PHILO_STAT = QP::QS_USER,
        PAUSED_STAT,
    };

    // QS source IDs
    static QP::QSpyId const l_SysTick_Handler { QP::QS_ID_AP };

    static USART_TypeDef * const l_USART0 = ((USART_TypeDef *)(0x40010000UL));

    static QP::QSTimeCtr QS_tickTime_;
    static QP::QSTimeCtr QS_tickPeriod_;
#endif // Q_SPY

} // unnamed namespace

//============================================================================
// Error handler and ISRs...
extern "C" {

Q_NORETURN Q_onError(char const * const module, int_t const id) {
    // NOTE: this implementation of the error handler is intended only
    // for debugging and MUST be changed for deployment of the application.
    Q_UNUSED_PAR(module);
    Q_UNUSED_PAR(id);
    QS_ASSERTION(module, id, 10000U); // report assertion to QS

#ifndef NDEBUG
    // light up both LEDs
    GPIO->P[LED_PORT].DOUT |= ((1U << LED0_PIN) | (1U << LED1_PIN));
    for (;;) { // for debugging, hang on in an endless loop...
    }
#else
    NVIC_SystemReset();
    for (;;) { // explicitly "no-return"
    }
#endif
}
//............................................................................
// assertion failure handler for the startup code and libraries
void assert_failed(char const * const module, int_t const id); // prototype
void assert_failed(char const * const module, int_t const id) {
    Q_onError(module, id);
}

// ISRs used in the application ==============================================
void SysTick_Handler(void); // prototype
void SysTick_Handler(void) {

    //QP::QTimeEvt::TICK_X(0U, &l_SysTick_Handler); // time events at rate 0
    APP::QTicker_inst0.TRIG(&l_SysTick_Handler); // trigger ticker AO

    static QP::QEvt const tickEvt(APP::TIME_TICK_SIG);
    QP::QF::PUBLISH(&tickEvt, &l_SysTick_Handler); // publish to subscribers

    // Perform the debouncing of buttons. The algorithm for debouncing
    // adapted from the book "Embedded Systems Dictionary" by Jack Ganssle
    // and Michael Barr, page 71.
    static struct {
        std::uint32_t depressed;
        std::uint32_t previous;
    } buttons = { 0U, 0U };

    std::uint32_t current = ~GPIO->P[PB_PORT].DIN; // read PB0 and BP1
    std::uint32_t tmp = buttons.depressed; // save the depressed buttons
    buttons.depressed |= (buttons.previous & current); // set depressed
    buttons.depressed &= (buttons.previous | current); // clear released
    buttons.previous   = current; // update the history
    tmp ^= buttons.depressed;     // changed debounced depressed
    current = buttons.depressed;

    if ((tmp & (1U << PB0_PIN)) != 0U) {  // debounced PB0 state changed?
        if ((current & (1U << PB0_PIN)) != 0U) { // is PB0 depressed?
            static QP::QEvt const trigEvt(APP::PLAYER_TRIGGER_SIG);
            QP::QF::PUBLISH(&trigEvt, &l_SysTick_Handler);
        }
    }

#ifdef Q_SPY
    tmp = SysTick->CTRL; // clear CTRL_COUNTFLAG
    QS_tickTime_ += QS_tickPeriod_; // account for the clock rollover
#endif

    QV_ARM_ERRATUM_838869();
}

//............................................................................
#ifdef Q_SPY
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QV and is not disabled. Such ISRs don't need to call
// QV_ISR_ENTRY/QV_ISR_EXIT and they cannot post or publish events.

void USART0_RX_IRQHandler(void); // prototype
void USART0_RX_IRQHandler(void) {
    // while RX FIFO NOT empty
    while ((l_USART0->STATUS & USART_STATUS_RXDATAV) != 0U) {
        std::uint32_t b = static_cast<uint8_t>(l_USART0->RXDATA);
        QP::QS::rxPut(b);
    }

    QV_ARM_ERRATUM_838869();
}
#endif // Q_SPY

